app/Http/Controllers/SuperAdmin/Communicate/CommunicateController.php

select * from `sm_schools` where `active_status` = 1 order by `school_name` asc
select * from `super_admin_audit_logs` where `action` = 'communication_sent' order by `created_at` desc limit 20
---
    public function index()
    {
        $schools = SmSchool::where('active_status', 1)->orderBy('school_name')->get();
        $sentMessages = SuperAdminAuditLog::where('action', 'communication_sent')
            ->orderBy('created_at', 'desc')
            ->limit(20)
            ->get();