app/Helpers/Basic.php

    function getMenus($role_name = 'staff')
    {

       $menus =  SmMenu::with([
                    'childs' => function($q) use ($role_name) {
                        $q->where('menu_status',1)
                        ->when($role_name == 'student',function($q){ $q->where('role_id',2); })
                        ->when($role_name == 'parent',function($q){ $q->where('role_id',3); })
                        ->when($role_name == 'staff',function($q){ $q->where('role_id',1); })->orderBy('position','ASC');
                    },'childs.childs' => function($q) use($role_name) {
                            $q->where('menu_status',1) ->when($role_name == 'student',function($q){ $q->where('role_id',2); })
                            ->when($role_name == 'parent',function($q){ $q->where('role_id',3); })
                            ->when($role_name == 'staff',function($q){ $q->where('role_id',1); })->orderBy('position','ASC');
                    }])
                    ->where('menu_status',1)
                    ->where('permission_section',1)
                    ->when($role_name == 'student',function($q){ $q->where('role_id',2); })
                    ->when($role_name == 'parent',function($q){ $q->where('role_id',3); })
                    ->when($role_name == 'staff',function($q){ $q->where('role_id',1); })
                    ->orderBy('position','ASC')
                    ->get();
---
select * from `sm_menus` where `sm_menus`.`parent_id` in (69077, 69080, 69124, 69182, 69206, 69226, 69249, 69266, 69301, 69381) and `menu_status` = 1 and `role_id` = 1 order by `position` asc