app/Helpers/Helper.php

    function dateConvert($input_date)
    {
        try {
            $system_date_format = session()->get('system_date_format');
            if (empty($system_date_format)) {
                $date_format_id = SmGeneralSettings::where('id', 1)->first(['date_format_id'])->date_format_id;
                $system_date_format = SmDateFormat::where('id', $date_format_id)->first(['format'])->format;
---
select `date_format_id` from `sm_general_settings` where `id` = 1 limit 1
select `format` from `sm_date_formats` where `id` = 1 limit 1

    function getUserLanguage()
    {

        if (Auth::check()) {
            return userLanguage();
        }

        $school_id = app()->bound('school') ? app('school')->id : 1;
        $user = User::where('role_id', 1)->where('school_id', $school_id)->first();
---
select * from `users` where `role_id` = 1 and `school_id` = 1 limit 1

    function userRtlLtl()
    {
        // return 1;

        if (session()->has('user_text_direction')) {
            return session()->get('user_text_direction');
        }

        $school_id = app()->bound('school') ? app('school')->id : 1;
        $user = User::where('role_id', 1)->where('school_id', $school_id)->first();
---
select * from `users` where `role_id` = 1 and `school_id` = 1 limit 1