app/Http/Controllers/SuperAdmin/Impersonate/ImpersonateController.php

select * from `sm_schools` where `active_status` = 1 order by `school_name` asc
---
    public function index()
    {
        $schools = SmSchool::where('active_status', 1)
            ->orderBy('school_name')
            ->get();