app/Http/Controllers/SuperAdmin/DashboardController.php

    public function index()
    {
        $superAdmin = Auth::guard('superadmin')->user();

        // Initialize metrics with defaults
        $totalSchools = 0;
        $activeSchools = 0;
        $inactiveSchools = 0;
        $totalStudents = 0;
        $totalStaff = 0;
        $totalParents = 0;
        $totalUsers = 0;
        $activeSubscriptions = 0;
        $totalRevenue = 0;

        try {
            // School Statistics
            if (DB::getSchemaBuilder()->hasTable('sm_schools')) {
                $totalSchools = SmSchool::count();
                $activeSchools = SmSchool::where('active_status', 1)->count();
---
select count(*) as aggregate from `sm_schools`
select count(*) as aggregate from `sm_schools` where `active_status` = 1