app/Http/Controllers/SuperAdmin/Users/TenantUsersController.php

    public function students(Request $request)
    {
        $query = SmStudent::with(['school', 'class', 'section', 'parents']);

        if ($request->filled('search')) {
            $search = $request->search;
            $query->where(function($q) use ($search) {
                $q->where('full_name', 'like', "%{$search}%")
                  ->orWhere('email', 'like', "%{$search}%")
                  ->orWhere('admission_no', 'like', "%{$search}%");
            });
        }

        if ($request->filled('school_id')) {
            $query->where('school_id', $request->school_id);
        }

        if ($request->filled('status')) {
            $query->where('active_status', $request->status == 'active' ? 1 : 0);
        }

        if ($request->filled('class_id')) {
            $query->where('class_id', $request->class_id);
        }

        if ($request->filled('section_id')) {
            $query->where('section_id', $request->section_id);
        }

        if ($request->filled('gender_id')) {
            $query->where('gender_id', $request->gender_id);
---
select * from `sm_parents` where `sm_parents`.`id` in (56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75)
select * from `sm_schools` where `sm_schools`.`id` in (1)
select * from `sm_schools` where `sm_schools`.`id` in (7)


        $students = $query->orderBy('id', 'desc')->paginate(20);

        $schools = SmSchool::where('active_status', 1)->orderBy('school_name', 'asc')->get();
---
select * from `sm_schools` where `active_status` = 1 order by `school_name` asc

    public function staff(Request $request)
    {
        $query = SmStaff::with(['school', 'roles.saasAssignments.permissionInfo', 'departments', 'designations']);

        if ($request->filled('search')) {
            $search = $request->search;
            $query->where(function($q) use ($search) {
                $q->where('full_name', 'like', "%{$search}%")
                  ->orWhere('email', 'like', "%{$search}%")
                  ->orWhere('staff_no', 'like', "%{$search}%");
            });
        }

        if ($request->filled('school_id')) {
            $query->where('school_id', $request->school_id);
        }

        if ($request->filled('status')) {
            $query->where('active_status', $request->status == 'active' ? 1 : 0);
        }

        if ($request->filled('role_id')) {
            $query->where('role_id', $request->role_id);
        }

        if ($request->filled('department_id')) {
            $query->where('department_id', $request->department_id);
        }

        if ($request->filled('designation_id')) {
            $query->where('designation_id', $request->designation_id);
---
select * from `sm_schools` where `sm_schools`.`id` in (1)
select * from `permissions` where `permissions`.`id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 64, 65, 66, 67, 68, 69, 73, 74, 75, 82, 83, 84, 85, 177, 206, 207, 211, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 232, 234, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 311, 430, 511, 512, 513, 514, 515, 516, 868, 869, 870, 871, 872, 873, 874, 875, 876, 877, 879, 880, 881, 882, 883, 884, 885, 886, 887, 888, 889, 890, 891, 892, 893, 894, 895, 896, 897, 898, 899, 900, 901, 902, 903, 904, 905, 906, 907, 908, 909, 910, 911, 912, 913, 914, 915, 916, 917, 918, 919, 920, 921, 922, 923, 930, 931, 932, 933, 934, 935, 939, 940, 941, 948, 949, 950, 951, 1043, 1072, 1073, 1077, 1081, 1082, 1083, 1084, 1085, 1086, 1087, 1088, 1089, 1090, 1091, 1092, 1093, 1094, 1095, 1098, 1100, 1153, 1154, 1155, 1156, 1157, 1158, 1159, 1160, 1161, 1162, 1163, 1164, 1177, 1295, 1376, 1377, 1378, 1379, 1380, 1381)
select * from `sm_designations` where `sm_designations`.`id` in (1) and `sm_designations`.`active_status` = 1
select * from `sm_schools` where `sm_schools`.`id` in (4, 5, 6, 7)


        $staffs = $query->orderBy('id', 'desc')->paginate(20);

        $schools = SmSchool::where('active_status', 1)->orderBy('school_name', 'asc')->get();
        $roles = InfixRole::orderBy('name', 'asc')->get();
---
select * from `sm_schools` where `active_status` = 1 order by `school_name` asc
select * from `infix_roles` order by `name` asc

    public function parents(Request $request)
    {
        $query = SmParent::with(['school']);

        if ($request->filled('search')) {
            $search = $request->search;
            $query->where(function($q) use ($search) {
                $q->where('fathers_name', 'like', "%{$search}%")
                  ->orWhere('mothers_name', 'like', "%{$search}%")
                  ->orWhere('guardians_email', 'like', "%{$search}%");
            });
        }

        if ($request->filled('school_id')) {
            $query->where('school_id', $request->school_id);
        }

        if ($request->filled('status')) {
            $query->where('active_status', $request->status == 'active' ? 1 : 0);
        }

        if ($request->filled('occupation')) {
            $query->where(function($q) use ($request) {
                $q->where('fathers_occupation', 'like', "%{$request->occupation}%")
                  ->orWhere('mothers_occupation', 'like', "%{$request->occupation}%")
                  ->orWhere('guardians_occupation', 'like', "%{$request->occupation}%");
            });
        }

        $parents = $query->orderBy('id', 'desc')->paginate(20);
        $schools = SmSchool::where('active_status', 1)->orderBy('school_name', 'asc')->get();
---
select * from `sm_parents` order by `id` desc limit 20 offset 0
select * from `sm_schools` where `sm_schools`.`id` in (1)
select count(*) as aggregate from `sm_parents`
select * from `sm_schools` where `active_status` = 1 order by `school_name` asc