app/Http/Controllers/SuperAdmin/Users/UsersController.php

    public function index()
    {
        $users = Cache::remember('superadmin_users_list', 300, function () {
            return SuperAdmin::orderBy('created_at', 'desc')->paginate(20);
---
select * from `super_admins` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `super_admins`