app/Http/Controllers/HomeController.php

select * from `due_fees_login_prevents` where `user_id` = 1 and `school_id` = 1 and `role_id` = 1 limit 1
---
    public function dashboard()
    {

        $user = Auth::user();
        $role_id = $user->role_id;
        $is_due_fees_login_permission = generalSetting()->due_fees_login;
        $due_fees_login_prevent = DueFeesLoginPrevent::where('user_id', $user->id)->where('school_id', $user->school_id)->where('role_id', $role_id)->first();

select `amount`, `date` from `sm_add_incomes` where `academic_id` = 1 and `name` != 'Fund Transfer' and `school_id` = 1 and `active_status` = 1 and `date` >= '2026-01-01' and `date` <= '2026-04-08' and `sm_add_incomes`.`active_status` = 1 and `sm_add_incomes`.`school_id` = 1
select `amount`, `date` from `sm_add_expenses` where `academic_id` = 1 and `name` != 'Fund Transfer' and `school_id` = 1 and `active_status` = 1 and `date` >= '2026-01-01' and `date` <= '2026-04-08' and `sm_add_expenses`.`active_status` = 1 and `sm_add_expenses`.`school_id` = 1
---
    public function index(Request $request)
    {
        $chart_data = ' ';
        $day_incomes = SmAddIncome::where('academic_id', getAcademicId())
            ->where('name', '!=', 'Fund Transfer')
            ->where('school_id', Auth::user()->school_id)
            ->where('active_status', 1)
            ->where('date', '>=', date('Y').'-01-01')
            ->where('date', '<=', date('Y-m-d'))
            ->get(['amount', 'date']);

        $day_expenses = SmAddExpense::where('academic_id', getAcademicId())
            ->where('name', '!=', 'Fund Transfer')
            ->where('school_id', Auth::user()->school_id)
            ->where('active_status', 1)
            ->where('date', '>=', date('Y').'-01-01')
            ->where('date', '<=', date('Y-m-d'))
            ->get(['amount', 'date']);

select * from `sm_events` where `active_status` = 1 and `academic_id` = 1 and `school_id` = 1 and `for_whom` = 'All' and `sm_events`.`active_status` = 1 and `sm_events`.`academic_id` = 1 and `sm_events`.`school_id` = 1
---
                })
                ->get();
        } else {
            $events = SmEvent::where('active_status', 1)
                ->where('academic_id', getAcademicId())
                ->where('school_id', Auth::user()->school_id)
                ->where('for_whom', 'All')
                ->get();

select * from `sm_holidays` where `active_status` = 1 and `academic_id` = 1 and `school_id` = 1 and `sm_holidays`.`academic_id` = 1 and `sm_holidays`.`school_id` = 1
---
        $staffs = SmStaff::where('school_id', $school_id)
            ->where('active_status', 1);

        $holidays = SmHoliday::where('active_status', 1)
            ->where('academic_id', getAcademicId())
            ->where('school_id', $school_id)
            ->get();

select * from `sm_notice_boards` where `active_status` = 1 and `academic_id` = 1 and `school_id` = 1 and `publish_on` <= '2026-04-08' and `sm_notice_boards`.`active_status` = 1 and `sm_notice_boards`.`academic_id` = 1 and `sm_notice_boards`.`school_id` = 1
select count(*) as aggregate from `sm_students` where `active_status` = 1 and `school_id` = 1 and `sm_students`.`school_id` = 1
select count(distinct `parent_id`) as aggregate from `sm_students` where `active_status` = 1 and `school_id` = 1 and `parent_id` is not null and `sm_students`.`school_id` = 1
select count(*) as aggregate from `sm_staffs` where `school_id` = 1 and `active_status` = 1 and `role_id` = 4 and `sm_staffs`.`active_status` = 1 and `sm_staffs`.`school_id` = 1
select count(*) as aggregate from `sm_staffs` where `school_id` = 1 and `active_status` = 1 and `role_id` != 1 and `sm_staffs`.`active_status` = 1 and `sm_staffs`.`school_id` = 1
---

        $notices = SmNoticeBoard::query();
        $notices->where('active_status', 1)->where('academic_id', getAcademicId())->where('school_id', $school_id)->where('publish_on', '<=', date('Y-m-d'));
        $notices->when(auth()->user()->role_id !== 1, function ($query): void {
            $query->where('inform_to', 'LIKE', '%'.auth()->user()->role_id.'%');
        });
        $notices = $notices->get();

        $totalStudents = SmStudent::where('active_status', 1)->where('school_id', $school_id)->count();
        $totalParents = SmStudent::where('active_status', 1)->where('school_id', $school_id)->whereNotNull('parent_id')->distinct('parent_id')->count('parent_id');
        $totalTeachers = SmStaff::where('school_id', $school_id)->where('active_status', 1)->where('role_id', 4)->count();
        $totalStaffs = SmStaff::where('school_id', $school_id)->where('active_status', 1)->where('role_id', '!=', 1)->count();

select * from `sm_to_dos` where `created_by` = 1 and `school_id` = 1
---
            'totalTeachers' => $totalTeachers,
            'totalStaffs' => $totalStaffs,

            'toDos' => SmToDo::where('created_by', $user_id)
                ->where('school_id', $school_id)
                ->get(),

select * from `infix_roles` where `is_saas` = 0 and (`school_id` = 1 or `type` = 'System') and `id` not in (1, 2)
---
        }

        $data['settings'] = SmCalendarSetting::get();
        $data['roles'] = InfixRole::where('is_saas', 0)->where(function ($q): void {
            $q->where('school_id', auth()->user()->school_id)->orWhere('type', 'System');
        })
            ->whereNotIn('id', [1, 2])
            ->get();

select * from `wallet_transactions` where `status` = 'approve' and `updated_at` like '2026-04-%' and `school_id` = 1
---
    private function showWalletBalance(string $diposit, string $refund, string $expense, string $feesRefund, string $date, $school_id)
    {

        $walletTranscations = WalletTransaction::where('status', 'approve')
            ->where('updated_at', 'like', date($date).'%')
            ->where('school_id', $school_id)
            ->get();