app/Http/Controllers/SuperAdmin/SchoolManagement/SchoolController.php

select * from `sm_schools` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `sm_schools` where `active_status` = 0
---
    public function schoolList(Request $request)
    {
        $query = SmSchool::query();

        // Apply filters
        if ($request->filled('status')) {
            $query->where('active_status', $request->status == 'active' ? 1 : 0);
        }

        if ($request->filled('search')) {
            $search = $request->search;
            $query->where(function ($q) use ($search) {
                $q->where('school_name', 'like', "%{$search}%")
                  ->orWhere('email', 'like', "%{$search}%")
                  ->orWhere('phone', 'like', "%{$search}%");
            });
        }

        $schools = $query->orderBy('id', 'desc')->paginate(20);