app/Http/Controllers/SuperAdmin/Subscription/SubscriptionController.php

    public function index(Request $request)
    {
        $query = SmSchool::where('id', '!=', 1); // Exclude global school

        if ($request->filled('search')) {
            $query->where('school_name', 'like', "%{$request->search}%")
                  ->orWhere('email', 'like', "%{$request->search}%");
        }

        if ($request->filled('status')) {
            $query->where('active_status', $request->status == 'active' ? 1 : 0);
        }

        $subscriptions = $query->orderBy('ending_date', 'asc')->paginate(20);
---
select * from `sm_schools` where `id` != 1 order by `ending_date` asc limit 20 offset 0
select count(*) as aggregate from `sm_schools` where `id` != 1